app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"
---
  def index
    @admins = Admin.all.page(params[:page])

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$12$abo1aAudqn7PJaaIp6Cun.4E2sIj6MUQhJqZN8V2rYY38rbm2dV8e"], ["updated_at", "2020-07-26 03:03:44.607785"], ["id", 13]]
---
  def update
    if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 13]]
---
  def destroy
    if @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_admin
    @admin = Admin.find(params[:id])