app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @admin = Admin.find(params[:id])

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def update
    admin = Admin.find(params[:id])